# ******************************************************************************
# Title     : Pythonで学ぶ実験計画法
# Chapter   : 3 データ解析や回帰分析の手法
# Theme     : データの読込
# Date      : 2021/11/07
# Page      : P21 - P23
# ******************************************************************************

# ＜目次＞
# 0 準備
# 1 CSVデータの読込


# 0 準備 ----------------------------------------------------------------

# ライブラリ
import pandas as pd


# 1 CSVデータの読込 ------------------------------------------------------

# データ読み込み
# --- インデックスを予め指定
dataset = pd.read_csv('csv/resin.csv', index_col=0, header=0)

# データ読み込み（日本語を含む場合）
# --- エンコーディングを設定
# dataset = pd.read_csv('resin.csv', encoding='SHIFT-JIS', index_col=0, header=0)

# データ確認
print(dataset)
