# ***************************************************************************************
# Title     : Python実践機械学習システム 100本ノック`
# Chapter   : 第1部 データ分析システム
# Section   : 第1章 分析に向けた準備を行う10本ノック
# Theme     : ノック1：データを全て読み込んでみよう
# Created by: Owner
# Created on: 2021/4/26
# Page      : P16 - P20
# ***************************************************************************************


# ＜概要＞
# - プロジェクトで使用するデータを読み込む


# ＜目次＞
# 0 準備
# １ データを読込


# 0 準備 -------------------------------------------------------------------------------

# ライブラリ
import pandas as pd


# １ データを読込 -----------------------------------------------------------------------

# 店舗マスタ
m_store = pd.read_csv("book/py_knock100_ml/data/m_store.csv")

# データ確認
print(m_store)
len(m_store)
m_store.head()


# 地域マスタ
m_area = pd.read_csv("book/py_knock100_ml/data/m_area.csv")
m_area

# 注文データ
tbl_order_4 = pd.read_csv("book/py_knock100_ml/data/tbl_order_202004.csv")
tbl_order_4
