# ***************************************************************************************
# Title     : Python実践機械学習システム 100本ノック`
# Chapter   : 第1部 データ分析システム
# Section   : 第1章 分析に向けた準備を行う10本ノック
# Theme     : ノック2：データを結合（ユニオン）してみよう
# Created by: Owner
# Created on: 2021/4/26
# Page      : P20 - P22
# ***************************************************************************************


# ＜概要＞
# - データを結合する


# ＜目次＞
# 0 準備
# 1 データ結合


# 0 準備 -------------------------------------------------------------------------------

# ライブラリ
import pandas as pd


# データロード
tbl_order_4 = pd.read_csv("book/py_knock100_ml/data/tbl_order_202004.csv")
tbl_order_5 = pd.read_csv("book/py_knock100_ml/data/tbl_order_202005.csv")


# 1 データ結合 -------------------------------------------------------------------------

# データ結合
order_all = pd.concat([tbl_order_4, tbl_order_5], ignore_index=True)

# レコード数の確認
len(order_all) == len(tbl_order_4) + len(tbl_order_5)
